In [50]:
import pandas as pd

## Creating a data frame

In [51]:
names = ['Alexander', 'Robert', 'Cynthia', 'Jessica', 'Alan', 'Danny', 'Maria', 'Karim']
ages = [29, 19, 21, 45, 34, 34, 51, 27]
cities = ['Moscow', 'New York', 'Paris', 'Berlin', 'Tokyo', 'Berlin', 'Madrid', 'Tomsk']
test_scores = [20, 72, 13, 43, 38, 34, 8, 89]

In [52]:
test_data = {'Name': names, 'City': cities, 'Age': ages, 'Test score': test_scores}

In [54]:
id = ['id 001', 'id 002', 'id 003', 'id 004', 'id 005', 'id 006', 'id 007', 'id 008']

In [55]:
df = pd.DataFrame(test_data, index=id)

In [56]:
df

             Name      City  Age  Test score
id 001  Alexander    Moscow   29          20
id 002     Robert  New York   19          72
id 003    Cynthia     Paris   21          13
id 004    Jessica    Berlin   45          43
id 005       Alan     Tokyo   34          38
id 006      Danny    Berlin   34          34
id 007      Maria    Madrid   51           8
id 008      Karim     Tomsk   27          89

In [57]:
type(df)

pandas.core.frame.DataFrame

In [58]:
df.index

Index(['id 001', 'id 002', 'id 003', 'id 004', 'id 005', 'id 006', 'id 007',
       'id 008'],
      dtype='object')

In [59]:
df.columns

Index(['Name', 'City', 'Age', 'Test score'], dtype='object')

In [60]:
type(df.columns), type(df.columns[2]), df.columns[2]

(pandas.core.indexes.base.Index, str, 'Age')

In [61]:
for col in df.columns:
    print(col)

Name
City
Age
Test score

In [62]:
df.head()

             Name      City  Age  Test score
id 001  Alexander    Moscow   29          20
id 002     Robert  New York   19          72
id 003    Cynthia     Paris   21          13
id 004    Jessica    Berlin   45          43
id 005       Alan     Tokyo   34          38

In [63]:
df.tail()

           Name    City  Age  Test score
id 004  Jessica  Berlin   45          43
id 005     Alan   Tokyo   34          38
id 006    Danny  Berlin   34          34
id 007    Maria  Madrid   51           8
id 008    Karim   Tomsk   27          89

In [64]:
df.head(3)

             Name      City  Age  Test score
id 001  Alexander    Moscow   29          20
id 002     Robert  New York   19          72
id 003    Cynthia     Paris   21          13

In [65]:
df.tail(2)

         Name    City  Age  Test score
id 007  Maria  Madrid   51           8
id 008  Karim   Tomsk   27          89